tsung_logs/testing/app_v1_login_logout/20211128-0005/tsung_login_logout.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="20000" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="yon01.eba-fz2dfqnp.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>
  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="10" unit="second">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="10" unit="second">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="7" duration="10" unit="second">
      <users arrivalrate="128" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="8" duration="10" unit="second">
      <users arrivalrate="256" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="9" duration="10" unit="second">
      <users arrivalrate="512" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="10" duration="10" unit="second">
      <users arrivalrate="1024" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>
  </options>

  <sessions>

    <session name="login-logout" weight="1" type="ts_http">

        <request>
            <dyn_variable name="authenticity_token"/>
            <http url="/d/users/sign_in/" version="1.1" method="GET"/>
         </request>

        <thinktime value="5" random="true"/>

        <setdynvars sourcetype="random_number" start="1" end="100">
          <var name="random_num"/>
        </setdynvars>

        <setdynvars code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global,{return,list}]) end." sourcetype="eval">
          <var name="encoded_authenticity_token"/>
        </setdynvars>

        <if var="encoded_authenticity_token" neq="">
          <request subst="true">
              <http url="/d/users/sign_in/" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;user%5Bemail%5D=user_%%_random_num%%%40gmail.com&amp;user%5Bpassword%5D=Password1234&amp;user%5Bremember_me%5D=0&amp;commit=Log+in">
              </http>
          </request>
        </if>

<thinktime value="2" random="true"/>
        

        <request>
          <dyn_variable name="authenticity_token_logout" xpath="//head/meta[@name='csrf-token']/@content"/>
          <http url="/users/profile" version="1.1" method="GET"/>
        </request>

        <setdynvars code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token_logout,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global,{return,list}]) end." sourcetype="eval">
          <var name="encoded_authenticity_token_logout"/>
        </setdynvars>

        <if var="encoded_authenticity_token_logout" neq="">
          <request subst="true">
              <http url="/d/users/sign_out" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="_method=delete&amp;authenticity_token=%%_encoded_authenticity_token_logout%%">
              </http>
          </request>
        </if>
            
    </session>
    
  </sessions>
</tsung>